rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_FTM.h
/*
** ###################################################################
**     Processor:           S32M24x
**     Reference manual:    S32M24x RM Rev.2 Draft A
**     Version:             rev. 1.3, 2023-05-30
**     Build:               b230530
**
**     Abstract:
**         Peripheral Access Layer for S32M24x
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2023 NXP
**
**     NXP Confidential. This software is owned or controlled by NXP and may
**     only be used strictly in accordance with the applicable license terms.
**     By expressly accepting such terms or by downloading, installing,
**     activating and/or otherwise using the software, you are agreeing that
**     you have read, and that you agree to comply with and are bound by,
**     such license terms. If you do not agree to be bound by the applicable
**     license terms, then you may not retain, install, activate or otherwise
**     use the software.
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
** ###################################################################
*/

/*!
 * @file S32M24x_FTM.h
 * @version 1.3
 * @date 2023-05-30
 * @brief Peripheral Access Layer for S32M24x_FTM
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
 * @page misra_violations MISRA-C:2012 violations
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
 * The SoC header defines typedef for all modules.
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
 * The SoC header defines macros for all modules and registers.
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
 * These are generated macros used for accessing the bit-fields from registers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.1, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.2, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.4, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.5, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
 * This type qualifier is needed to ensure correct I/O access and addressing.
 */

/* Prevention from multiple including the same memory map */
#if !defined(S32M24x_FTM_H_) /* Check if memory map has not been already included */
#define S32M24x_FTM_H_

#include "S32M24x_COMMON.h"

/* ----------------------------------------------------------------------------
   -- FTM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FTM_Peripheral_Access_Layer FTM Peripheral Access Layer
 * @{
 */

/** FTM - Size of Registers Arrays */
#define FTM_CONTROLS_COUNT 8u
#define FTM_CV_MIRROR_COUNT 8u

/** FTM - Register Layout Typedef */
typedef struct {
    __IO uint32_t SC;  /**< Status And Control, offset: 0x0 */
    __IO uint32_t CNT; /**< Counter, offset: 0x4 */
    __IO uint32_t MOD; /**< Modulo, offset: 0x8 */
    struct {           /* offset: 0xC, array step: 0x8 */
        __IO uint32_t
            CSC;          /**< Channel (n) Status And Control, array offset: 0xC, array step: 0x8 */
        __IO uint32_t CV; /**< Channel (n) Value, array offset: 0x10, array step: 0x8 */
    } CONTROLS[FTM_CONTROLS_COUNT];
    __IO uint32_t CNTIN;    /**< Counter Initial Value, offset: 0x4C */
    __IO uint32_t STATUS;   /**< Capture And Compare Status, offset: 0x50 */
    __IO uint32_t MODE;     /**< Features Mode Selection, offset: 0x54 */
    __IO uint32_t SYNC;     /**< Synchronization, offset: 0x58 */
    __IO uint32_t OUTINIT;  /**< Initial State For Channels Output, offset: 0x5C */
    __IO uint32_t OUTMASK;  /**< Output Mask, offset: 0x60 */
    __IO uint32_t COMBINE;  /**< Function For Linked Channels, offset: 0x64 */
    __IO uint32_t DEADTIME; /**< Deadtime Configuration, offset: 0x68 */
    __IO uint32_t EXTTRIG;  /**< FTM External Trigger, offset: 0x6C */
    __IO uint32_t POL;      /**< Channels Polarity, offset: 0x70 */
    __IO uint32_t FMS;      /**< Fault Mode Status, offset: 0x74 */
    __IO uint32_t FILTER;   /**< Input Capture Filter Control, offset: 0x78 */
    __IO uint32_t FLTCTRL;  /**< Fault Control, offset: 0x7C */
    __IO uint32_t QDCTRL;   /**< Quadrature Decoder Control And Status, offset: 0x80, available only
                               on: FTM1, FTM2 (missing on FTM0, FTM3) */
    __IO uint32_t CONF;     /**< Configuration, offset: 0x84 */
    __IO uint32_t FLTPOL;   /**< FTM Fault Input Polarity, offset: 0x88 */
    __IO uint32_t SYNCONF;  /**< Synchronization Configuration, offset: 0x8C */
    __IO uint32_t INVCTRL;  /**< FTM Inverting Control, offset: 0x90 */
    __IO uint32_t SWOCTRL;  /**< FTM Software Output Control, offset: 0x94 */
    __IO uint32_t PWMLOAD;  /**< FTM PWM Load, offset: 0x98 */
    __IO uint32_t HCR;      /**< Half Cycle Register, offset: 0x9C */
    __IO uint32_t PAIR0DEADTIME; /**< Pair 0 Deadtime Configuration, offset: 0xA0 */
    uint8_t RESERVED_0[4];
    __IO uint32_t PAIR1DEADTIME; /**< Pair 1 Deadtime Configuration, offset: 0xA8 */
    uint8_t RESERVED_1[4];
    __IO uint32_t PAIR2DEADTIME; /**< Pair 2 Deadtime Configuration, offset: 0xB0 */
    uint8_t RESERVED_2[4];
    __IO uint32_t PAIR3DEADTIME; /**< Pair 3 Deadtime Configuration, offset: 0xB8 */
    uint8_t RESERVED_3[324];
    __IO uint32_t MOD_MIRROR; /**< Mirror of Modulo Value, offset: 0x200, available only on: FTM1,
                                 FTM2 (missing on FTM0, FTM3) */
    __IO uint32_t CV_MIRROR[FTM_CV_MIRROR_COUNT]; /**< Mirror of Channel (n) Match Value, array
                                                     offset: 0x204, array step: 0x4, available only
                                                     on: FTM1, FTM2 (missing on FTM0, FTM3) */
} FTM_Type, *FTM_MemMapPtr;

/** Number of instances of the FTM module. */
#define FTM_INSTANCE_COUNT (4u)

/* FTM - Peripheral instance base addresses */
/** Peripheral FTM0 base address */
#define IP_FTM0_BASE (0x40038000u)
/** Peripheral FTM0 base pointer */
#define IP_FTM0 ((FTM_Type*)IP_FTM0_BASE)
/** Peripheral FTM1 base address */
#define IP_FTM1_BASE (0x40039000u)
/** Peripheral FTM1 base pointer */
#define IP_FTM1 ((FTM_Type*)IP_FTM1_BASE)
/** Peripheral FTM2 base address */
#define IP_FTM2_BASE (0x4003A000u)
/** Peripheral FTM2 base pointer */
#define IP_FTM2 ((FTM_Type*)IP_FTM2_BASE)
/** Peripheral FTM3 base address */
#define IP_FTM3_BASE (0x40026000u)
/** Peripheral FTM3 base pointer */
#define IP_FTM3 ((FTM_Type*)IP_FTM3_BASE)
/** Array initializer of FTM peripheral base addresses */
#define IP_FTM_BASE_ADDRS                                                                          \
    {                                                                                              \
        IP_FTM0_BASE, IP_FTM1_BASE, IP_FTM2_BASE, IP_FTM3_BASE                                     \
    }
/** Array initializer of FTM peripheral base pointers */
#define IP_FTM_BASE_PTRS                                                                           \
    {                                                                                              \
        IP_FTM0, IP_FTM1, IP_FTM2, IP_FTM3                                                         \
    }

/* ----------------------------------------------------------------------------
   -- FTM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FTM_Register_Masks FTM Register Masks
 * @{
 */

