rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_FTM.h
/*! @name SC - Status And Control */
/*! @{ */

#define FTM_SC_PS_MASK (0x7U)
#define FTM_SC_PS_SHIFT (0U)
#define FTM_SC_PS_WIDTH (3U)
#define FTM_SC_PS(x) (((uint32_t)(((uint32_t)(x)) << FTM_SC_PS_SHIFT)) & FTM_SC_PS_MASK)

#define FTM_SC_CLKS_MASK (0x18U)
#define FTM_SC_CLKS_SHIFT (3U)
#define FTM_SC_CLKS_WIDTH (2U)
#define FTM_SC_CLKS(x) (((uint32_t)(((uint32_t)(x)) << FTM_SC_CLKS_SHIFT)) & FTM_SC_CLKS_MASK)

#define FTM_SC_CPWMS_MASK (0x20U)
#define FTM_SC_CPWMS_SHIFT (5U)
#define FTM_SC_CPWMS_WIDTH (1U)
#define FTM_SC_CPWMS(x) (((uint32_t)(((uint32_t)(x)) << FTM_SC_CPWMS_SHIFT)) & FTM_SC_CPWMS_MASK)

#define FTM_SC_RIE_MASK (0x40U)
#define FTM_SC_RIE_SHIFT (6U)
#define FTM_SC_RIE_WIDTH (1U)
#define FTM_SC_RIE(x) (((uint32_t)(((uint32_t)(x)) << FTM_SC_RIE_SHIFT)) & FTM_SC_RIE_MASK)

#define FTM_SC_RF_MASK (0x80U)
#define FTM_SC_RF_SHIFT (7U)
#define FTM_SC_RF_WIDTH (1U)
#define FTM_SC_RF(x) (((uint32_t)(((uint32_t)(x)) << FTM_SC_RF_SHIFT)) & FTM_SC_RF_MASK)

#define FTM_SC_TOIE_MASK (0x100U)
#define FTM_SC_TOIE_SHIFT (8U)
#define FTM_SC_TOIE_WIDTH (1U)
#define FTM_SC_TOIE(x) (((uint32_t)(((uint32_t)(x)) << FTM_SC_TOIE_SHIFT)) & FTM_SC_TOIE_MASK)

#define FTM_SC_TOF_MASK (0x200U)
#define FTM_SC_TOF_SHIFT (9U)
#define FTM_SC_TOF_WIDTH (1U)
#define FTM_SC_TOF(x) (((uint32_t)(((uint32_t)(x)) << FTM_SC_TOF_SHIFT)) & FTM_SC_TOF_MASK)

#define FTM_SC_PWMEN0_MASK (0x10000U)
#define FTM_SC_PWMEN0_SHIFT (16U)
#define FTM_SC_PWMEN0_WIDTH (1U)
#define FTM_SC_PWMEN0(x) (((uint32_t)(((uint32_t)(x)) << FTM_SC_PWMEN0_SHIFT)) & FTM_SC_PWMEN0_MASK)

#define FTM_SC_PWMEN1_MASK (0x20000U)
#define FTM_SC_PWMEN1_SHIFT (17U)
#define FTM_SC_PWMEN1_WIDTH (1U)
#define FTM_SC_PWMEN1(x) (((uint32_t)(((uint32_t)(x)) << FTM_SC_PWMEN1_SHIFT)) & FTM_SC_PWMEN1_MASK)

#define FTM_SC_PWMEN2_MASK (0x40000U)
#define FTM_SC_PWMEN2_SHIFT (18U)
#define FTM_SC_PWMEN2_WIDTH (1U)
#define FTM_SC_PWMEN2(x) (((uint32_t)(((uint32_t)(x)) << FTM_SC_PWMEN2_SHIFT)) & FTM_SC_PWMEN2_MASK)

#define FTM_SC_PWMEN3_MASK (0x80000U)
#define FTM_SC_PWMEN3_SHIFT (19U)
#define FTM_SC_PWMEN3_WIDTH (1U)
#define FTM_SC_PWMEN3(x) (((uint32_t)(((uint32_t)(x)) << FTM_SC_PWMEN3_SHIFT)) & FTM_SC_PWMEN3_MASK)

#define FTM_SC_PWMEN4_MASK (0x100000U)
#define FTM_SC_PWMEN4_SHIFT (20U)
#define FTM_SC_PWMEN4_WIDTH (1U)
#define FTM_SC_PWMEN4(x) (((uint32_t)(((uint32_t)(x)) << FTM_SC_PWMEN4_SHIFT)) & FTM_SC_PWMEN4_MASK)

#define FTM_SC_PWMEN5_MASK (0x200000U)
#define FTM_SC_PWMEN5_SHIFT (21U)
#define FTM_SC_PWMEN5_WIDTH (1U)
#define FTM_SC_PWMEN5(x) (((uint32_t)(((uint32_t)(x)) << FTM_SC_PWMEN5_SHIFT)) & FTM_SC_PWMEN5_MASK)

#define FTM_SC_PWMEN6_MASK (0x400000U)
#define FTM_SC_PWMEN6_SHIFT (22U)
#define FTM_SC_PWMEN6_WIDTH (1U)
#define FTM_SC_PWMEN6(x) (((uint32_t)(((uint32_t)(x)) << FTM_SC_PWMEN6_SHIFT)) & FTM_SC_PWMEN6_MASK)

#define FTM_SC_PWMEN7_MASK (0x800000U)
#define FTM_SC_PWMEN7_SHIFT (23U)
#define FTM_SC_PWMEN7_WIDTH (1U)
#define FTM_SC_PWMEN7(x) (((uint32_t)(((uint32_t)(x)) << FTM_SC_PWMEN7_SHIFT)) & FTM_SC_PWMEN7_MASK)

#define FTM_SC_FLTPS_MASK (0xF000000U)
#define FTM_SC_FLTPS_SHIFT (24U)
#define FTM_SC_FLTPS_WIDTH (4U)
#define FTM_SC_FLTPS(x) (((uint32_t)(((uint32_t)(x)) << FTM_SC_FLTPS_SHIFT)) & FTM_SC_FLTPS_MASK)
/*! @} */

/*! @name CNT - Counter */
/*! @{ */

#define FTM_CNT_COUNT_MASK (0xFFFFU)
#define FTM_CNT_COUNT_SHIFT (0U)
#define FTM_CNT_COUNT_WIDTH (16U)
#define FTM_CNT_COUNT(x) (((uint32_t)(((uint32_t)(x)) << FTM_CNT_COUNT_SHIFT)) & FTM_CNT_COUNT_MASK)
/*! @} */

/*! @name MOD - Modulo */
/*! @{ */

#define FTM_MOD_MOD_MASK (0xFFFFU)
#define FTM_MOD_MOD_SHIFT (0U)
#define FTM_MOD_MOD_WIDTH (16U)
#define FTM_MOD_MOD(x) (((uint32_t)(((uint32_t)(x)) << FTM_MOD_MOD_SHIFT)) & FTM_MOD_MOD_MASK)
/*! @} */

/*! @name CnSC - Channel (n) Status And Control */
/*! @{ */

#define FTM_CSC_DMA_MASK (0x1U)
#define FTM_CSC_DMA_SHIFT (0U)
#define FTM_CSC_DMA_WIDTH (1U)
#define FTM_CSC_DMA(x) (((uint32_t)(((uint32_t)(x)) << FTM_CSC_DMA_SHIFT)) & FTM_CSC_DMA_MASK)

#define FTM_CSC_ICRST_MASK (0x2U)
#define FTM_CSC_ICRST_SHIFT (1U)
#define FTM_CSC_ICRST_WIDTH (1U)
#define FTM_CSC_ICRST(x) (((uint32_t)(((uint32_t)(x)) << FTM_CSC_ICRST_SHIFT)) & FTM_CSC_ICRST_MASK)

#define FTM_CSC_ELSA_MASK (0x4U)
#define FTM_CSC_ELSA_SHIFT (2U)
#define FTM_CSC_ELSA_WIDTH (1U)
#define FTM_CSC_ELSA(x) (((uint32_t)(((uint32_t)(x)) << FTM_CSC_ELSA_SHIFT)) & FTM_CSC_ELSA_MASK)

#define FTM_CSC_ELSB_MASK (0x8U)
#define FTM_CSC_ELSB_SHIFT (3U)
#define FTM_CSC_ELSB_WIDTH (1U)
#define FTM_CSC_ELSB(x) (((uint32_t)(((uint32_t)(x)) << FTM_CSC_ELSB_SHIFT)) & FTM_CSC_ELSB_MASK)

#define FTM_CSC_MSA_MASK (0x10U)
#define FTM_CSC_MSA_SHIFT (4U)
#define FTM_CSC_MSA_WIDTH (1U)
#define FTM_CSC_MSA(x) (((uint32_t)(((uint32_t)(x)) << FTM_CSC_MSA_SHIFT)) & FTM_CSC_MSA_MASK)

#define FTM_CSC_MSB_MASK (0x20U)
#define FTM_CSC_MSB_SHIFT (5U)
#define FTM_CSC_MSB_WIDTH (1U)
#define FTM_CSC_MSB(x) (((uint32_t)(((uint32_t)(x)) << FTM_CSC_MSB_SHIFT)) & FTM_CSC_MSB_MASK)

#define FTM_CSC_CHIE_MASK (0x40U)
#define FTM_CSC_CHIE_SHIFT (6U)
#define FTM_CSC_CHIE_WIDTH (1U)
#define FTM_CSC_CHIE(x) (((uint32_t)(((uint32_t)(x)) << FTM_CSC_CHIE_SHIFT)) & FTM_CSC_CHIE_MASK)

#define FTM_CSC_CHF_MASK (0x80U)
#define FTM_CSC_CHF_SHIFT (7U)
#define FTM_CSC_CHF_WIDTH (1U)
#define FTM_CSC_CHF(x) (((uint32_t)(((uint32_t)(x)) << FTM_CSC_CHF_SHIFT)) & FTM_CSC_CHF_MASK)

#define FTM_CSC_TRIGMODE_MASK (0x100U)
#define FTM_CSC_TRIGMODE_SHIFT (8U)
#define FTM_CSC_TRIGMODE_WIDTH (1U)
#define FTM_CSC_TRIGMODE(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << FTM_CSC_TRIGMODE_SHIFT)) & FTM_CSC_TRIGMODE_MASK)

#define FTM_CSC_CHIS_MASK (0x200U)
#define FTM_CSC_CHIS_SHIFT (9U)
#define FTM_CSC_CHIS_WIDTH (1U)
#define FTM_CSC_CHIS(x) (((uint32_t)(((uint32_t)(x)) << FTM_CSC_CHIS_SHIFT)) & FTM_CSC_CHIS_MASK)

#define FTM_CSC_CHOV_MASK (0x400U)
#define FTM_CSC_CHOV_SHIFT (10U)
#define FTM_CSC_CHOV_WIDTH (1U)
#define FTM_CSC_CHOV(x) (((uint32_t)(((uint32_t)(x)) << FTM_CSC_CHOV_SHIFT)) & FTM_CSC_CHOV_MASK)
/*! @} */

/*! @name CnV - Channel (n) Value */
/*! @{ */

#define FTM_CV_VAL_MASK (0xFFFFU)
#define FTM_CV_VAL_SHIFT (0U)
#define FTM_CV_VAL_WIDTH (16U)
#define FTM_CV_VAL(x) (((uint32_t)(((uint32_t)(x)) << FTM_CV_VAL_SHIFT)) & FTM_CV_VAL_MASK)
/*! @} */

/*! @name CNTIN - Counter Initial Value */
/*! @{ */

#define FTM_CNTIN_INIT_MASK (0xFFFFU)
#define FTM_CNTIN_INIT_SHIFT (0U)
#define FTM_CNTIN_INIT_WIDTH (16U)
#define FTM_CNTIN_INIT(x)                                                                          \
    (((uint32_t)(((uint32_t)(x)) << FTM_CNTIN_INIT_SHIFT)) & FTM_CNTIN_INIT_MASK)
/*! @} */

/*! @name STATUS - Capture And Compare Status */
/*! @{ */

#define FTM_STATUS_CH0F_MASK (0x1U)
#define FTM_STATUS_CH0F_SHIFT (0U)
#define FTM_STATUS_CH0F_WIDTH (1U)
#define FTM_STATUS_CH0F(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << FTM_STATUS_CH0F_SHIFT)) & FTM_STATUS_CH0F_MASK)

#define FTM_STATUS_CH1F_MASK (0x2U)
#define FTM_STATUS_CH1F_SHIFT (1U)
#define FTM_STATUS_CH1F_WIDTH (1U)
#define FTM_STATUS_CH1F(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << FTM_STATUS_CH1F_SHIFT)) & FTM_STATUS_CH1F_MASK)

