rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_FTM.h
#define FTM_STATUS_CH2F_MASK (0x4U)
#define FTM_STATUS_CH2F_SHIFT (2U)
#define FTM_STATUS_CH2F_WIDTH (1U)
#define FTM_STATUS_CH2F(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << FTM_STATUS_CH2F_SHIFT)) & FTM_STATUS_CH2F_MASK)

#define FTM_STATUS_CH3F_MASK (0x8U)
#define FTM_STATUS_CH3F_SHIFT (3U)
#define FTM_STATUS_CH3F_WIDTH (1U)
#define FTM_STATUS_CH3F(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << FTM_STATUS_CH3F_SHIFT)) & FTM_STATUS_CH3F_MASK)

#define FTM_STATUS_CH4F_MASK (0x10U)
#define FTM_STATUS_CH4F_SHIFT (4U)
#define FTM_STATUS_CH4F_WIDTH (1U)
#define FTM_STATUS_CH4F(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << FTM_STATUS_CH4F_SHIFT)) & FTM_STATUS_CH4F_MASK)

#define FTM_STATUS_CH5F_MASK (0x20U)
#define FTM_STATUS_CH5F_SHIFT (5U)
#define FTM_STATUS_CH5F_WIDTH (1U)
#define FTM_STATUS_CH5F(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << FTM_STATUS_CH5F_SHIFT)) & FTM_STATUS_CH5F_MASK)

#define FTM_STATUS_CH6F_MASK (0x40U)
#define FTM_STATUS_CH6F_SHIFT (6U)
#define FTM_STATUS_CH6F_WIDTH (1U)
#define FTM_STATUS_CH6F(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << FTM_STATUS_CH6F_SHIFT)) & FTM_STATUS_CH6F_MASK)

#define FTM_STATUS_CH7F_MASK (0x80U)
#define FTM_STATUS_CH7F_SHIFT (7U)
#define FTM_STATUS_CH7F_WIDTH (1U)
#define FTM_STATUS_CH7F(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << FTM_STATUS_CH7F_SHIFT)) & FTM_STATUS_CH7F_MASK)
/*! @} */

/*! @name MODE - Features Mode Selection */
/*! @{ */

#define FTM_MODE_FTMEN_MASK (0x1U)
#define FTM_MODE_FTMEN_SHIFT (0U)
#define FTM_MODE_FTMEN_WIDTH (1U)
#define FTM_MODE_FTMEN(x)                                                                          \
    (((uint32_t)(((uint32_t)(x)) << FTM_MODE_FTMEN_SHIFT)) & FTM_MODE_FTMEN_MASK)

#define FTM_MODE_INIT_MASK (0x2U)
#define FTM_MODE_INIT_SHIFT (1U)
#define FTM_MODE_INIT_WIDTH (1U)
#define FTM_MODE_INIT(x) (((uint32_t)(((uint32_t)(x)) << FTM_MODE_INIT_SHIFT)) & FTM_MODE_INIT_MASK)

#define FTM_MODE_WPDIS_MASK (0x4U)
#define FTM_MODE_WPDIS_SHIFT (2U)
#define FTM_MODE_WPDIS_WIDTH (1U)
#define FTM_MODE_WPDIS(x)                                                                          \
    (((uint32_t)(((uint32_t)(x)) << FTM_MODE_WPDIS_SHIFT)) & FTM_MODE_WPDIS_MASK)

#define FTM_MODE_PWMSYNC_MASK (0x8U)
#define FTM_MODE_PWMSYNC_SHIFT (3U)
#define FTM_MODE_PWMSYNC_WIDTH (1U)
#define FTM_MODE_PWMSYNC(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << FTM_MODE_PWMSYNC_SHIFT)) & FTM_MODE_PWMSYNC_MASK)

#define FTM_MODE_CAPTEST_MASK (0x10U)
#define FTM_MODE_CAPTEST_SHIFT (4U)
#define FTM_MODE_CAPTEST_WIDTH (1U)
#define FTM_MODE_CAPTEST(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << FTM_MODE_CAPTEST_SHIFT)) & FTM_MODE_CAPTEST_MASK)

#define FTM_MODE_FAULTM_MASK (0x60U)
#define FTM_MODE_FAULTM_SHIFT (5U)
#define FTM_MODE_FAULTM_WIDTH (2U)
#define FTM_MODE_FAULTM(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << FTM_MODE_FAULTM_SHIFT)) & FTM_MODE_FAULTM_MASK)

#define FTM_MODE_FAULTIE_MASK (0x80U)
#define FTM_MODE_FAULTIE_SHIFT (7U)
#define FTM_MODE_FAULTIE_WIDTH (1U)
#define FTM_MODE_FAULTIE(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << FTM_MODE_FAULTIE_SHIFT)) & FTM_MODE_FAULTIE_MASK)
/*! @} */

/*! @name SYNC - Synchronization */
/*! @{ */

#define FTM_SYNC_CNTMIN_MASK (0x1U)
#define FTM_SYNC_CNTMIN_SHIFT (0U)
#define FTM_SYNC_CNTMIN_WIDTH (1U)
#define FTM_SYNC_CNTMIN(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << FTM_SYNC_CNTMIN_SHIFT)) & FTM_SYNC_CNTMIN_MASK)

#define FTM_SYNC_CNTMAX_MASK (0x2U)
#define FTM_SYNC_CNTMAX_SHIFT (1U)
#define FTM_SYNC_CNTMAX_WIDTH (1U)
#define FTM_SYNC_CNTMAX(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << FTM_SYNC_CNTMAX_SHIFT)) & FTM_SYNC_CNTMAX_MASK)

#define FTM_SYNC_REINIT_MASK (0x4U)
#define FTM_SYNC_REINIT_SHIFT (2U)
#define FTM_SYNC_REINIT_WIDTH (1U)
#define FTM_SYNC_REINIT(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << FTM_SYNC_REINIT_SHIFT)) & FTM_SYNC_REINIT_MASK)

#define FTM_SYNC_SYNCHOM_MASK (0x8U)
#define FTM_SYNC_SYNCHOM_SHIFT (3U)
#define FTM_SYNC_SYNCHOM_WIDTH (1U)
#define FTM_SYNC_SYNCHOM(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << FTM_SYNC_SYNCHOM_SHIFT)) & FTM_SYNC_SYNCHOM_MASK)

#define FTM_SYNC_TRIG0_MASK (0x10U)
#define FTM_SYNC_TRIG0_SHIFT (4U)
#define FTM_SYNC_TRIG0_WIDTH (1U)
#define FTM_SYNC_TRIG0(x)                                                                          \
    (((uint32_t)(((uint32_t)(x)) << FTM_SYNC_TRIG0_SHIFT)) & FTM_SYNC_TRIG0_MASK)

#define FTM_SYNC_TRIG1_MASK (0x20U)
#define FTM_SYNC_TRIG1_SHIFT (5U)
#define FTM_SYNC_TRIG1_WIDTH (1U)
#define FTM_SYNC_TRIG1(x)                                                                          \
    (((uint32_t)(((uint32_t)(x)) << FTM_SYNC_TRIG1_SHIFT)) & FTM_SYNC_TRIG1_MASK)

#define FTM_SYNC_TRIG2_MASK (0x40U)
#define FTM_SYNC_TRIG2_SHIFT (6U)
#define FTM_SYNC_TRIG2_WIDTH (1U)
#define FTM_SYNC_TRIG2(x)                                                                          \
    (((uint32_t)(((uint32_t)(x)) << FTM_SYNC_TRIG2_SHIFT)) & FTM_SYNC_TRIG2_MASK)

#define FTM_SYNC_SWSYNC_MASK (0x80U)
#define FTM_SYNC_SWSYNC_SHIFT (7U)
#define FTM_SYNC_SWSYNC_WIDTH (1U)
#define FTM_SYNC_SWSYNC(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << FTM_SYNC_SWSYNC_SHIFT)) & FTM_SYNC_SWSYNC_MASK)
/*! @} */

