rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_FTM.h
/*! @name OUTINIT - Initial State For Channels Output */
/*! @{ */

#define FTM_OUTINIT_CH0OI_MASK (0x1U)
#define FTM_OUTINIT_CH0OI_SHIFT (0U)
#define FTM_OUTINIT_CH0OI_WIDTH (1U)
#define FTM_OUTINIT_CH0OI(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_OUTINIT_CH0OI_SHIFT)) & FTM_OUTINIT_CH0OI_MASK)

#define FTM_OUTINIT_CH1OI_MASK (0x2U)
#define FTM_OUTINIT_CH1OI_SHIFT (1U)
#define FTM_OUTINIT_CH1OI_WIDTH (1U)
#define FTM_OUTINIT_CH1OI(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_OUTINIT_CH1OI_SHIFT)) & FTM_OUTINIT_CH1OI_MASK)

#define FTM_OUTINIT_CH2OI_MASK (0x4U)
#define FTM_OUTINIT_CH2OI_SHIFT (2U)
#define FTM_OUTINIT_CH2OI_WIDTH (1U)
#define FTM_OUTINIT_CH2OI(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_OUTINIT_CH2OI_SHIFT)) & FTM_OUTINIT_CH2OI_MASK)

#define FTM_OUTINIT_CH3OI_MASK (0x8U)
#define FTM_OUTINIT_CH3OI_SHIFT (3U)
#define FTM_OUTINIT_CH3OI_WIDTH (1U)
#define FTM_OUTINIT_CH3OI(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_OUTINIT_CH3OI_SHIFT)) & FTM_OUTINIT_CH3OI_MASK)

#define FTM_OUTINIT_CH4OI_MASK (0x10U)
#define FTM_OUTINIT_CH4OI_SHIFT (4U)
#define FTM_OUTINIT_CH4OI_WIDTH (1U)
#define FTM_OUTINIT_CH4OI(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_OUTINIT_CH4OI_SHIFT)) & FTM_OUTINIT_CH4OI_MASK)

#define FTM_OUTINIT_CH5OI_MASK (0x20U)
#define FTM_OUTINIT_CH5OI_SHIFT (5U)
#define FTM_OUTINIT_CH5OI_WIDTH (1U)
#define FTM_OUTINIT_CH5OI(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_OUTINIT_CH5OI_SHIFT)) & FTM_OUTINIT_CH5OI_MASK)

#define FTM_OUTINIT_CH6OI_MASK (0x40U)
#define FTM_OUTINIT_CH6OI_SHIFT (6U)
#define FTM_OUTINIT_CH6OI_WIDTH (1U)
#define FTM_OUTINIT_CH6OI(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_OUTINIT_CH6OI_SHIFT)) & FTM_OUTINIT_CH6OI_MASK)

#define FTM_OUTINIT_CH7OI_MASK (0x80U)
#define FTM_OUTINIT_CH7OI_SHIFT (7U)
#define FTM_OUTINIT_CH7OI_WIDTH (1U)
#define FTM_OUTINIT_CH7OI(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_OUTINIT_CH7OI_SHIFT)) & FTM_OUTINIT_CH7OI_MASK)
/*! @} */

/*! @name OUTMASK - Output Mask */
/*! @{ */

#define FTM_OUTMASK_CH0OM_MASK (0x1U)
#define FTM_OUTMASK_CH0OM_SHIFT (0U)
#define FTM_OUTMASK_CH0OM_WIDTH (1U)
#define FTM_OUTMASK_CH0OM(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_OUTMASK_CH0OM_SHIFT)) & FTM_OUTMASK_CH0OM_MASK)

#define FTM_OUTMASK_CH1OM_MASK (0x2U)
#define FTM_OUTMASK_CH1OM_SHIFT (1U)
#define FTM_OUTMASK_CH1OM_WIDTH (1U)
#define FTM_OUTMASK_CH1OM(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_OUTMASK_CH1OM_SHIFT)) & FTM_OUTMASK_CH1OM_MASK)

#define FTM_OUTMASK_CH2OM_MASK (0x4U)
#define FTM_OUTMASK_CH2OM_SHIFT (2U)
#define FTM_OUTMASK_CH2OM_WIDTH (1U)
#define FTM_OUTMASK_CH2OM(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_OUTMASK_CH2OM_SHIFT)) & FTM_OUTMASK_CH2OM_MASK)

#define FTM_OUTMASK_CH3OM_MASK (0x8U)
#define FTM_OUTMASK_CH3OM_SHIFT (3U)
#define FTM_OUTMASK_CH3OM_WIDTH (1U)
#define FTM_OUTMASK_CH3OM(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_OUTMASK_CH3OM_SHIFT)) & FTM_OUTMASK_CH3OM_MASK)

#define FTM_OUTMASK_CH4OM_MASK (0x10U)
#define FTM_OUTMASK_CH4OM_SHIFT (4U)
#define FTM_OUTMASK_CH4OM_WIDTH (1U)
#define FTM_OUTMASK_CH4OM(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_OUTMASK_CH4OM_SHIFT)) & FTM_OUTMASK_CH4OM_MASK)

#define FTM_OUTMASK_CH5OM_MASK (0x20U)
#define FTM_OUTMASK_CH5OM_SHIFT (5U)
#define FTM_OUTMASK_CH5OM_WIDTH (1U)
#define FTM_OUTMASK_CH5OM(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_OUTMASK_CH5OM_SHIFT)) & FTM_OUTMASK_CH5OM_MASK)

#define FTM_OUTMASK_CH6OM_MASK (0x40U)
#define FTM_OUTMASK_CH6OM_SHIFT (6U)
#define FTM_OUTMASK_CH6OM_WIDTH (1U)
#define FTM_OUTMASK_CH6OM(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_OUTMASK_CH6OM_SHIFT)) & FTM_OUTMASK_CH6OM_MASK)

#define FTM_OUTMASK_CH7OM_MASK (0x80U)
#define FTM_OUTMASK_CH7OM_SHIFT (7U)
#define FTM_OUTMASK_CH7OM_WIDTH (1U)
#define FTM_OUTMASK_CH7OM(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_OUTMASK_CH7OM_SHIFT)) & FTM_OUTMASK_CH7OM_MASK)
/*! @} */

/*! @name COMBINE - Function For Linked Channels */
/*! @{ */

#define FTM_COMBINE_COMBINE0_MASK (0x1U)
#define FTM_COMBINE_COMBINE0_SHIFT (0U)
#define FTM_COMBINE_COMBINE0_WIDTH (1U)
#define FTM_COMBINE_COMBINE0(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_COMBINE0_SHIFT)) & FTM_COMBINE_COMBINE0_MASK)

#define FTM_COMBINE_COMP0_MASK (0x2U)
#define FTM_COMBINE_COMP0_SHIFT (1U)
#define FTM_COMBINE_COMP0_WIDTH (1U)
#define FTM_COMBINE_COMP0(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_COMP0_SHIFT)) & FTM_COMBINE_COMP0_MASK)

#define FTM_COMBINE_DECAPEN0_MASK (0x4U)
#define FTM_COMBINE_DECAPEN0_SHIFT (2U)
#define FTM_COMBINE_DECAPEN0_WIDTH (1U)
#define FTM_COMBINE_DECAPEN0(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_DECAPEN0_SHIFT)) & FTM_COMBINE_DECAPEN0_MASK)

#define FTM_COMBINE_DECAP0_MASK (0x8U)
#define FTM_COMBINE_DECAP0_SHIFT (3U)
#define FTM_COMBINE_DECAP0_WIDTH (1U)
#define FTM_COMBINE_DECAP0(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_DECAP0_SHIFT)) & FTM_COMBINE_DECAP0_MASK)

