rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_FTM.h
#define FTM_COMBINE_DTEN0_MASK (0x10U)
#define FTM_COMBINE_DTEN0_SHIFT (4U)
#define FTM_COMBINE_DTEN0_WIDTH (1U)
#define FTM_COMBINE_DTEN0(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_DTEN0_SHIFT)) & FTM_COMBINE_DTEN0_MASK)

#define FTM_COMBINE_SYNCEN0_MASK (0x20U)
#define FTM_COMBINE_SYNCEN0_SHIFT (5U)
#define FTM_COMBINE_SYNCEN0_WIDTH (1U)
#define FTM_COMBINE_SYNCEN0(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_SYNCEN0_SHIFT)) & FTM_COMBINE_SYNCEN0_MASK)

#define FTM_COMBINE_FAULTEN0_MASK (0x40U)
#define FTM_COMBINE_FAULTEN0_SHIFT (6U)
#define FTM_COMBINE_FAULTEN0_WIDTH (1U)
#define FTM_COMBINE_FAULTEN0(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_FAULTEN0_SHIFT)) & FTM_COMBINE_FAULTEN0_MASK)

#define FTM_COMBINE_MCOMBINE0_MASK (0x80U)
#define FTM_COMBINE_MCOMBINE0_SHIFT (7U)
#define FTM_COMBINE_MCOMBINE0_WIDTH (1U)
#define FTM_COMBINE_MCOMBINE0(x)                                                                   \
    (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_MCOMBINE0_SHIFT)) & FTM_COMBINE_MCOMBINE0_MASK)

#define FTM_COMBINE_COMBINE1_MASK (0x100U)
#define FTM_COMBINE_COMBINE1_SHIFT (8U)
#define FTM_COMBINE_COMBINE1_WIDTH (1U)
#define FTM_COMBINE_COMBINE1(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_COMBINE1_SHIFT)) & FTM_COMBINE_COMBINE1_MASK)

#define FTM_COMBINE_COMP1_MASK (0x200U)
#define FTM_COMBINE_COMP1_SHIFT (9U)
#define FTM_COMBINE_COMP1_WIDTH (1U)
#define FTM_COMBINE_COMP1(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_COMP1_SHIFT)) & FTM_COMBINE_COMP1_MASK)

#define FTM_COMBINE_DECAPEN1_MASK (0x400U)
#define FTM_COMBINE_DECAPEN1_SHIFT (10U)
#define FTM_COMBINE_DECAPEN1_WIDTH (1U)
#define FTM_COMBINE_DECAPEN1(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_DECAPEN1_SHIFT)) & FTM_COMBINE_DECAPEN1_MASK)

#define FTM_COMBINE_DECAP1_MASK (0x800U)
#define FTM_COMBINE_DECAP1_SHIFT (11U)
#define FTM_COMBINE_DECAP1_WIDTH (1U)
#define FTM_COMBINE_DECAP1(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_DECAP1_SHIFT)) & FTM_COMBINE_DECAP1_MASK)

#define FTM_COMBINE_DTEN1_MASK (0x1000U)
#define FTM_COMBINE_DTEN1_SHIFT (12U)
#define FTM_COMBINE_DTEN1_WIDTH (1U)
#define FTM_COMBINE_DTEN1(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_DTEN1_SHIFT)) & FTM_COMBINE_DTEN1_MASK)

#define FTM_COMBINE_SYNCEN1_MASK (0x2000U)
#define FTM_COMBINE_SYNCEN1_SHIFT (13U)
#define FTM_COMBINE_SYNCEN1_WIDTH (1U)
#define FTM_COMBINE_SYNCEN1(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_SYNCEN1_SHIFT)) & FTM_COMBINE_SYNCEN1_MASK)

#define FTM_COMBINE_FAULTEN1_MASK (0x4000U)
#define FTM_COMBINE_FAULTEN1_SHIFT (14U)
#define FTM_COMBINE_FAULTEN1_WIDTH (1U)
#define FTM_COMBINE_FAULTEN1(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_FAULTEN1_SHIFT)) & FTM_COMBINE_FAULTEN1_MASK)

#define FTM_COMBINE_MCOMBINE1_MASK (0x8000U)
#define FTM_COMBINE_MCOMBINE1_SHIFT (15U)
#define FTM_COMBINE_MCOMBINE1_WIDTH (1U)
#define FTM_COMBINE_MCOMBINE1(x)                                                                   \
    (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_MCOMBINE1_SHIFT)) & FTM_COMBINE_MCOMBINE1_MASK)

#define FTM_COMBINE_COMBINE2_MASK (0x10000U)
#define FTM_COMBINE_COMBINE2_SHIFT (16U)
#define FTM_COMBINE_COMBINE2_WIDTH (1U)
#define FTM_COMBINE_COMBINE2(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_COMBINE2_SHIFT)) & FTM_COMBINE_COMBINE2_MASK)

#define FTM_COMBINE_COMP2_MASK (0x20000U)
#define FTM_COMBINE_COMP2_SHIFT (17U)
#define FTM_COMBINE_COMP2_WIDTH (1U)
#define FTM_COMBINE_COMP2(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_COMP2_SHIFT)) & FTM_COMBINE_COMP2_MASK)

#define FTM_COMBINE_DECAPEN2_MASK (0x40000U)
#define FTM_COMBINE_DECAPEN2_SHIFT (18U)
#define FTM_COMBINE_DECAPEN2_WIDTH (1U)
#define FTM_COMBINE_DECAPEN2(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_DECAPEN2_SHIFT)) & FTM_COMBINE_DECAPEN2_MASK)

#define FTM_COMBINE_DECAP2_MASK (0x80000U)
#define FTM_COMBINE_DECAP2_SHIFT (19U)
#define FTM_COMBINE_DECAP2_WIDTH (1U)
#define FTM_COMBINE_DECAP2(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_DECAP2_SHIFT)) & FTM_COMBINE_DECAP2_MASK)

#define FTM_COMBINE_DTEN2_MASK (0x100000U)
#define FTM_COMBINE_DTEN2_SHIFT (20U)
#define FTM_COMBINE_DTEN2_WIDTH (1U)
#define FTM_COMBINE_DTEN2(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_DTEN2_SHIFT)) & FTM_COMBINE_DTEN2_MASK)

#define FTM_COMBINE_SYNCEN2_MASK (0x200000U)
#define FTM_COMBINE_SYNCEN2_SHIFT (21U)
#define FTM_COMBINE_SYNCEN2_WIDTH (1U)
#define FTM_COMBINE_SYNCEN2(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_SYNCEN2_SHIFT)) & FTM_COMBINE_SYNCEN2_MASK)

#define FTM_COMBINE_FAULTEN2_MASK (0x400000U)
#define FTM_COMBINE_FAULTEN2_SHIFT (22U)
#define FTM_COMBINE_FAULTEN2_WIDTH (1U)
#define FTM_COMBINE_FAULTEN2(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_FAULTEN2_SHIFT)) & FTM_COMBINE_FAULTEN2_MASK)

#define FTM_COMBINE_MCOMBINE2_MASK (0x800000U)
#define FTM_COMBINE_MCOMBINE2_SHIFT (23U)
#define FTM_COMBINE_MCOMBINE2_WIDTH (1U)
#define FTM_COMBINE_MCOMBINE2(x)                                                                   \
    (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_MCOMBINE2_SHIFT)) & FTM_COMBINE_MCOMBINE2_MASK)

#define FTM_COMBINE_COMBINE3_MASK (0x1000000U)
#define FTM_COMBINE_COMBINE3_SHIFT (24U)
#define FTM_COMBINE_COMBINE3_WIDTH (1U)
#define FTM_COMBINE_COMBINE3(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_COMBINE3_SHIFT)) & FTM_COMBINE_COMBINE3_MASK)

#define FTM_COMBINE_COMP3_MASK (0x2000000U)
#define FTM_COMBINE_COMP3_SHIFT (25U)
#define FTM_COMBINE_COMP3_WIDTH (1U)
#define FTM_COMBINE_COMP3(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_COMP3_SHIFT)) & FTM_COMBINE_COMP3_MASK)

#define FTM_COMBINE_DECAPEN3_MASK (0x4000000U)
#define FTM_COMBINE_DECAPEN3_SHIFT (26U)
#define FTM_COMBINE_DECAPEN3_WIDTH (1U)
#define FTM_COMBINE_DECAPEN3(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_DECAPEN3_SHIFT)) & FTM_COMBINE_DECAPEN3_MASK)

#define FTM_COMBINE_DECAP3_MASK (0x8000000U)
#define FTM_COMBINE_DECAP3_SHIFT (27U)
#define FTM_COMBINE_DECAP3_WIDTH (1U)
#define FTM_COMBINE_DECAP3(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_DECAP3_SHIFT)) & FTM_COMBINE_DECAP3_MASK)

