rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_FTM.h
#define FTM_COMBINE_DTEN3_MASK (0x10000000U)
#define FTM_COMBINE_DTEN3_SHIFT (28U)
#define FTM_COMBINE_DTEN3_WIDTH (1U)
#define FTM_COMBINE_DTEN3(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_DTEN3_SHIFT)) & FTM_COMBINE_DTEN3_MASK)

#define FTM_COMBINE_SYNCEN3_MASK (0x20000000U)
#define FTM_COMBINE_SYNCEN3_SHIFT (29U)
#define FTM_COMBINE_SYNCEN3_WIDTH (1U)
#define FTM_COMBINE_SYNCEN3(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_SYNCEN3_SHIFT)) & FTM_COMBINE_SYNCEN3_MASK)

#define FTM_COMBINE_FAULTEN3_MASK (0x40000000U)
#define FTM_COMBINE_FAULTEN3_SHIFT (30U)
#define FTM_COMBINE_FAULTEN3_WIDTH (1U)
#define FTM_COMBINE_FAULTEN3(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_FAULTEN3_SHIFT)) & FTM_COMBINE_FAULTEN3_MASK)

#define FTM_COMBINE_MCOMBINE3_MASK (0x80000000U)
#define FTM_COMBINE_MCOMBINE3_SHIFT (31U)
#define FTM_COMBINE_MCOMBINE3_WIDTH (1U)
#define FTM_COMBINE_MCOMBINE3(x)                                                                   \
    (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_MCOMBINE3_SHIFT)) & FTM_COMBINE_MCOMBINE3_MASK)
/*! @} */

/*! @name DEADTIME - Deadtime Configuration */
/*! @{ */

#define FTM_DEADTIME_DTVAL_MASK (0x3FU)
#define FTM_DEADTIME_DTVAL_SHIFT (0U)
#define FTM_DEADTIME_DTVAL_WIDTH (6U)
#define FTM_DEADTIME_DTVAL(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_DEADTIME_DTVAL_SHIFT)) & FTM_DEADTIME_DTVAL_MASK)

#define FTM_DEADTIME_DTPS_MASK (0xC0U)
#define FTM_DEADTIME_DTPS_SHIFT (6U)
#define FTM_DEADTIME_DTPS_WIDTH (2U)
#define FTM_DEADTIME_DTPS(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_DEADTIME_DTPS_SHIFT)) & FTM_DEADTIME_DTPS_MASK)

#define FTM_DEADTIME_DTVALEX_MASK (0xF0000U)
#define FTM_DEADTIME_DTVALEX_SHIFT (16U)
#define FTM_DEADTIME_DTVALEX_WIDTH (4U)
#define FTM_DEADTIME_DTVALEX(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FTM_DEADTIME_DTVALEX_SHIFT)) & FTM_DEADTIME_DTVALEX_MASK)
/*! @} */

/*! @name EXTTRIG - FTM External Trigger */
/*! @{ */

#define FTM_EXTTRIG_CH2TRIG_MASK (0x1U)
#define FTM_EXTTRIG_CH2TRIG_SHIFT (0U)
#define FTM_EXTTRIG_CH2TRIG_WIDTH (1U)
#define FTM_EXTTRIG_CH2TRIG(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FTM_EXTTRIG_CH2TRIG_SHIFT)) & FTM_EXTTRIG_CH2TRIG_MASK)

#define FTM_EXTTRIG_CH3TRIG_MASK (0x2U)
#define FTM_EXTTRIG_CH3TRIG_SHIFT (1U)
#define FTM_EXTTRIG_CH3TRIG_WIDTH (1U)
#define FTM_EXTTRIG_CH3TRIG(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FTM_EXTTRIG_CH3TRIG_SHIFT)) & FTM_EXTTRIG_CH3TRIG_MASK)

#define FTM_EXTTRIG_CH4TRIG_MASK (0x4U)
#define FTM_EXTTRIG_CH4TRIG_SHIFT (2U)
#define FTM_EXTTRIG_CH4TRIG_WIDTH (1U)
#define FTM_EXTTRIG_CH4TRIG(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FTM_EXTTRIG_CH4TRIG_SHIFT)) & FTM_EXTTRIG_CH4TRIG_MASK)

#define FTM_EXTTRIG_CH5TRIG_MASK (0x8U)
#define FTM_EXTTRIG_CH5TRIG_SHIFT (3U)
#define FTM_EXTTRIG_CH5TRIG_WIDTH (1U)
#define FTM_EXTTRIG_CH5TRIG(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FTM_EXTTRIG_CH5TRIG_SHIFT)) & FTM_EXTTRIG_CH5TRIG_MASK)

#define FTM_EXTTRIG_CH0TRIG_MASK (0x10U)
#define FTM_EXTTRIG_CH0TRIG_SHIFT (4U)
#define FTM_EXTTRIG_CH0TRIG_WIDTH (1U)
#define FTM_EXTTRIG_CH0TRIG(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FTM_EXTTRIG_CH0TRIG_SHIFT)) & FTM_EXTTRIG_CH0TRIG_MASK)

#define FTM_EXTTRIG_CH1TRIG_MASK (0x20U)
#define FTM_EXTTRIG_CH1TRIG_SHIFT (5U)
#define FTM_EXTTRIG_CH1TRIG_WIDTH (1U)
#define FTM_EXTTRIG_CH1TRIG(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FTM_EXTTRIG_CH1TRIG_SHIFT)) & FTM_EXTTRIG_CH1TRIG_MASK)

#define FTM_EXTTRIG_INITTRIGEN_MASK (0x40U)
#define FTM_EXTTRIG_INITTRIGEN_SHIFT (6U)
#define FTM_EXTTRIG_INITTRIGEN_WIDTH (1U)
#define FTM_EXTTRIG_INITTRIGEN(x)                                                                  \
    (((uint32_t)(((uint32_t)(x)) << FTM_EXTTRIG_INITTRIGEN_SHIFT)) & FTM_EXTTRIG_INITTRIGEN_MASK)

#define FTM_EXTTRIG_TRIGF_MASK (0x80U)
#define FTM_EXTTRIG_TRIGF_SHIFT (7U)
#define FTM_EXTTRIG_TRIGF_WIDTH (1U)
#define FTM_EXTTRIG_TRIGF(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_EXTTRIG_TRIGF_SHIFT)) & FTM_EXTTRIG_TRIGF_MASK)

#define FTM_EXTTRIG_CH6TRIG_MASK (0x100U)
#define FTM_EXTTRIG_CH6TRIG_SHIFT (8U)
#define FTM_EXTTRIG_CH6TRIG_WIDTH (1U)
#define FTM_EXTTRIG_CH6TRIG(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FTM_EXTTRIG_CH6TRIG_SHIFT)) & FTM_EXTTRIG_CH6TRIG_MASK)

#define FTM_EXTTRIG_CH7TRIG_MASK (0x200U)
#define FTM_EXTTRIG_CH7TRIG_SHIFT (9U)
#define FTM_EXTTRIG_CH7TRIG_WIDTH (1U)
#define FTM_EXTTRIG_CH7TRIG(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FTM_EXTTRIG_CH7TRIG_SHIFT)) & FTM_EXTTRIG_CH7TRIG_MASK)
/*! @} */

/*! @name POL - Channels Polarity */
/*! @{ */

#define FTM_POL_POL0_MASK (0x1U)
#define FTM_POL_POL0_SHIFT (0U)
#define FTM_POL_POL0_WIDTH (1U)
#define FTM_POL_POL0(x) (((uint32_t)(((uint32_t)(x)) << FTM_POL_POL0_SHIFT)) & FTM_POL_POL0_MASK)

#define FTM_POL_POL1_MASK (0x2U)
#define FTM_POL_POL1_SHIFT (1U)
#define FTM_POL_POL1_WIDTH (1U)
#define FTM_POL_POL1(x) (((uint32_t)(((uint32_t)(x)) << FTM_POL_POL1_SHIFT)) & FTM_POL_POL1_MASK)

#define FTM_POL_POL2_MASK (0x4U)
#define FTM_POL_POL2_SHIFT (2U)
#define FTM_POL_POL2_WIDTH (1U)
#define FTM_POL_POL2(x) (((uint32_t)(((uint32_t)(x)) << FTM_POL_POL2_SHIFT)) & FTM_POL_POL2_MASK)

#define FTM_POL_POL3_MASK (0x8U)
#define FTM_POL_POL3_SHIFT (3U)
#define FTM_POL_POL3_WIDTH (1U)
#define FTM_POL_POL3(x) (((uint32_t)(((uint32_t)(x)) << FTM_POL_POL3_SHIFT)) & FTM_POL_POL3_MASK)

#define FTM_POL_POL4_MASK (0x10U)
#define FTM_POL_POL4_SHIFT (4U)
#define FTM_POL_POL4_WIDTH (1U)
#define FTM_POL_POL4(x) (((uint32_t)(((uint32_t)(x)) << FTM_POL_POL4_SHIFT)) & FTM_POL_POL4_MASK)

#define FTM_POL_POL5_MASK (0x20U)
#define FTM_POL_POL5_SHIFT (5U)
#define FTM_POL_POL5_WIDTH (1U)
#define FTM_POL_POL5(x) (((uint32_t)(((uint32_t)(x)) << FTM_POL_POL5_SHIFT)) & FTM_POL_POL5_MASK)

#define FTM_POL_POL6_MASK (0x40U)
#define FTM_POL_POL6_SHIFT (6U)
#define FTM_POL_POL6_WIDTH (1U)
#define FTM_POL_POL6(x) (((uint32_t)(((uint32_t)(x)) << FTM_POL_POL6_SHIFT)) & FTM_POL_POL6_MASK)

#define FTM_POL_POL7_MASK (0x80U)
#define FTM_POL_POL7_SHIFT (7U)
#define FTM_POL_POL7_WIDTH (1U)
#define FTM_POL_POL7(x) (((uint32_t)(((uint32_t)(x)) << FTM_POL_POL7_SHIFT)) & FTM_POL_POL7_MASK)
/*! @} */

/*! @name FMS - Fault Mode Status */
/*! @{ */

#define FTM_FMS_FAULTF0_MASK (0x1U)
#define FTM_FMS_FAULTF0_SHIFT (0U)
#define FTM_FMS_FAULTF0_WIDTH (1U)
#define FTM_FMS_FAULTF0(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << FTM_FMS_FAULTF0_SHIFT)) & FTM_FMS_FAULTF0_MASK)

#define FTM_FMS_FAULTF1_MASK (0x2U)
#define FTM_FMS_FAULTF1_SHIFT (1U)
#define FTM_FMS_FAULTF1_WIDTH (1U)
#define FTM_FMS_FAULTF1(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << FTM_FMS_FAULTF1_SHIFT)) & FTM_FMS_FAULTF1_MASK)

#define FTM_FMS_FAULTF2_MASK (0x4U)
#define FTM_FMS_FAULTF2_SHIFT (2U)
#define FTM_FMS_FAULTF2_WIDTH (1U)
#define FTM_FMS_FAULTF2(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << FTM_FMS_FAULTF2_SHIFT)) & FTM_FMS_FAULTF2_MASK)

#define FTM_FMS_FAULTF3_MASK (0x8U)
#define FTM_FMS_FAULTF3_SHIFT (3U)
#define FTM_FMS_FAULTF3_WIDTH (1U)
#define FTM_FMS_FAULTF3(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << FTM_FMS_FAULTF3_SHIFT)) & FTM_FMS_FAULTF3_MASK)

#define FTM_FMS_FAULTIN_MASK (0x20U)
#define FTM_FMS_FAULTIN_SHIFT (5U)
#define FTM_FMS_FAULTIN_WIDTH (1U)
#define FTM_FMS_FAULTIN(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << FTM_FMS_FAULTIN_SHIFT)) & FTM_FMS_FAULTIN_MASK)

