rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_FTM.h
#define FTM_FMS_WPEN_MASK (0x40U)
#define FTM_FMS_WPEN_SHIFT (6U)
#define FTM_FMS_WPEN_WIDTH (1U)
#define FTM_FMS_WPEN(x) (((uint32_t)(((uint32_t)(x)) << FTM_FMS_WPEN_SHIFT)) & FTM_FMS_WPEN_MASK)

#define FTM_FMS_FAULTF_MASK (0x80U)
#define FTM_FMS_FAULTF_SHIFT (7U)
#define FTM_FMS_FAULTF_WIDTH (1U)
#define FTM_FMS_FAULTF(x)                                                                          \
    (((uint32_t)(((uint32_t)(x)) << FTM_FMS_FAULTF_SHIFT)) & FTM_FMS_FAULTF_MASK)
/*! @} */

/*! @name FILTER - Input Capture Filter Control */
/*! @{ */

#define FTM_FILTER_CH0FVAL_MASK (0xFU)
#define FTM_FILTER_CH0FVAL_SHIFT (0U)
#define FTM_FILTER_CH0FVAL_WIDTH (4U)
#define FTM_FILTER_CH0FVAL(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_FILTER_CH0FVAL_SHIFT)) & FTM_FILTER_CH0FVAL_MASK)

#define FTM_FILTER_CH1FVAL_MASK (0xF0U)
#define FTM_FILTER_CH1FVAL_SHIFT (4U)
#define FTM_FILTER_CH1FVAL_WIDTH (4U)
#define FTM_FILTER_CH1FVAL(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_FILTER_CH1FVAL_SHIFT)) & FTM_FILTER_CH1FVAL_MASK)

#define FTM_FILTER_CH2FVAL_MASK (0xF00U)
#define FTM_FILTER_CH2FVAL_SHIFT (8U)
#define FTM_FILTER_CH2FVAL_WIDTH (4U)
#define FTM_FILTER_CH2FVAL(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_FILTER_CH2FVAL_SHIFT)) & FTM_FILTER_CH2FVAL_MASK)

#define FTM_FILTER_CH3FVAL_MASK (0xF000U)
#define FTM_FILTER_CH3FVAL_SHIFT (12U)
#define FTM_FILTER_CH3FVAL_WIDTH (4U)
#define FTM_FILTER_CH3FVAL(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_FILTER_CH3FVAL_SHIFT)) & FTM_FILTER_CH3FVAL_MASK)
/*! @} */

/*! @name FLTCTRL - Fault Control */
/*! @{ */

#define FTM_FLTCTRL_FAULT0EN_MASK (0x1U)
#define FTM_FLTCTRL_FAULT0EN_SHIFT (0U)
#define FTM_FLTCTRL_FAULT0EN_WIDTH (1U)
#define FTM_FLTCTRL_FAULT0EN(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FTM_FLTCTRL_FAULT0EN_SHIFT)) & FTM_FLTCTRL_FAULT0EN_MASK)

#define FTM_FLTCTRL_FAULT1EN_MASK (0x2U)
#define FTM_FLTCTRL_FAULT1EN_SHIFT (1U)
#define FTM_FLTCTRL_FAULT1EN_WIDTH (1U)
#define FTM_FLTCTRL_FAULT1EN(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FTM_FLTCTRL_FAULT1EN_SHIFT)) & FTM_FLTCTRL_FAULT1EN_MASK)

#define FTM_FLTCTRL_FAULT2EN_MASK (0x4U)
#define FTM_FLTCTRL_FAULT2EN_SHIFT (2U)
#define FTM_FLTCTRL_FAULT2EN_WIDTH (1U)
#define FTM_FLTCTRL_FAULT2EN(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FTM_FLTCTRL_FAULT2EN_SHIFT)) & FTM_FLTCTRL_FAULT2EN_MASK)

#define FTM_FLTCTRL_FAULT3EN_MASK (0x8U)
#define FTM_FLTCTRL_FAULT3EN_SHIFT (3U)
#define FTM_FLTCTRL_FAULT3EN_WIDTH (1U)
#define FTM_FLTCTRL_FAULT3EN(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FTM_FLTCTRL_FAULT3EN_SHIFT)) & FTM_FLTCTRL_FAULT3EN_MASK)

#define FTM_FLTCTRL_FFLTR0EN_MASK (0x10U)
#define FTM_FLTCTRL_FFLTR0EN_SHIFT (4U)
#define FTM_FLTCTRL_FFLTR0EN_WIDTH (1U)
#define FTM_FLTCTRL_FFLTR0EN(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FTM_FLTCTRL_FFLTR0EN_SHIFT)) & FTM_FLTCTRL_FFLTR0EN_MASK)

#define FTM_FLTCTRL_FFLTR1EN_MASK (0x20U)
#define FTM_FLTCTRL_FFLTR1EN_SHIFT (5U)
#define FTM_FLTCTRL_FFLTR1EN_WIDTH (1U)
#define FTM_FLTCTRL_FFLTR1EN(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FTM_FLTCTRL_FFLTR1EN_SHIFT)) & FTM_FLTCTRL_FFLTR1EN_MASK)

#define FTM_FLTCTRL_FFLTR2EN_MASK (0x40U)
#define FTM_FLTCTRL_FFLTR2EN_SHIFT (6U)
#define FTM_FLTCTRL_FFLTR2EN_WIDTH (1U)
#define FTM_FLTCTRL_FFLTR2EN(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FTM_FLTCTRL_FFLTR2EN_SHIFT)) & FTM_FLTCTRL_FFLTR2EN_MASK)

#define FTM_FLTCTRL_FFLTR3EN_MASK (0x80U)
#define FTM_FLTCTRL_FFLTR3EN_SHIFT (7U)
#define FTM_FLTCTRL_FFLTR3EN_WIDTH (1U)
#define FTM_FLTCTRL_FFLTR3EN(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FTM_FLTCTRL_FFLTR3EN_SHIFT)) & FTM_FLTCTRL_FFLTR3EN_MASK)

#define FTM_FLTCTRL_FFVAL_MASK (0xF00U)
#define FTM_FLTCTRL_FFVAL_SHIFT (8U)
#define FTM_FLTCTRL_FFVAL_WIDTH (4U)
#define FTM_FLTCTRL_FFVAL(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_FLTCTRL_FFVAL_SHIFT)) & FTM_FLTCTRL_FFVAL_MASK)

#define FTM_FLTCTRL_FSTATE_MASK (0x8000U)
#define FTM_FLTCTRL_FSTATE_SHIFT (15U)
#define FTM_FLTCTRL_FSTATE_WIDTH (1U)
#define FTM_FLTCTRL_FSTATE(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_FLTCTRL_FSTATE_SHIFT)) & FTM_FLTCTRL_FSTATE_MASK)
/*! @} */

/*! @name QDCTRL - Quadrature Decoder Control And Status */
/*! @{ */

#define FTM_QDCTRL_QUADEN_MASK (0x1U)
#define FTM_QDCTRL_QUADEN_SHIFT (0U)
#define FTM_QDCTRL_QUADEN_WIDTH (1U)
#define FTM_QDCTRL_QUADEN(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_QDCTRL_QUADEN_SHIFT)) & FTM_QDCTRL_QUADEN_MASK)

#define FTM_QDCTRL_TOFDIR_MASK (0x2U)
#define FTM_QDCTRL_TOFDIR_SHIFT (1U)
#define FTM_QDCTRL_TOFDIR_WIDTH (1U)
#define FTM_QDCTRL_TOFDIR(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_QDCTRL_TOFDIR_SHIFT)) & FTM_QDCTRL_TOFDIR_MASK)

#define FTM_QDCTRL_QUADIR_MASK (0x4U)
#define FTM_QDCTRL_QUADIR_SHIFT (2U)
#define FTM_QDCTRL_QUADIR_WIDTH (1U)
#define FTM_QDCTRL_QUADIR(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_QDCTRL_QUADIR_SHIFT)) & FTM_QDCTRL_QUADIR_MASK)

#define FTM_QDCTRL_QUADMODE_MASK (0x8U)
#define FTM_QDCTRL_QUADMODE_SHIFT (3U)
#define FTM_QDCTRL_QUADMODE_WIDTH (1U)
#define FTM_QDCTRL_QUADMODE(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FTM_QDCTRL_QUADMODE_SHIFT)) & FTM_QDCTRL_QUADMODE_MASK)

#define FTM_QDCTRL_PHBPOL_MASK (0x10U)
#define FTM_QDCTRL_PHBPOL_SHIFT (4U)
#define FTM_QDCTRL_PHBPOL_WIDTH (1U)
#define FTM_QDCTRL_PHBPOL(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_QDCTRL_PHBPOL_SHIFT)) & FTM_QDCTRL_PHBPOL_MASK)

#define FTM_QDCTRL_PHAPOL_MASK (0x20U)
#define FTM_QDCTRL_PHAPOL_SHIFT (5U)
#define FTM_QDCTRL_PHAPOL_WIDTH (1U)
#define FTM_QDCTRL_PHAPOL(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_QDCTRL_PHAPOL_SHIFT)) & FTM_QDCTRL_PHAPOL_MASK)

#define FTM_QDCTRL_PHBFLTREN_MASK (0x40U)
#define FTM_QDCTRL_PHBFLTREN_SHIFT (6U)
#define FTM_QDCTRL_PHBFLTREN_WIDTH (1U)
#define FTM_QDCTRL_PHBFLTREN(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FTM_QDCTRL_PHBFLTREN_SHIFT)) & FTM_QDCTRL_PHBFLTREN_MASK)

