rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_FTM.h
#define FTM_QDCTRL_PHAFLTREN_MASK (0x80U)
#define FTM_QDCTRL_PHAFLTREN_SHIFT (7U)
#define FTM_QDCTRL_PHAFLTREN_WIDTH (1U)
#define FTM_QDCTRL_PHAFLTREN(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FTM_QDCTRL_PHAFLTREN_SHIFT)) & FTM_QDCTRL_PHAFLTREN_MASK)
/*! @} */

/*! @name CONF - Configuration */
/*! @{ */

#define FTM_CONF_LDFQ_MASK (0x1FU)
#define FTM_CONF_LDFQ_SHIFT (0U)
#define FTM_CONF_LDFQ_WIDTH (5U)
#define FTM_CONF_LDFQ(x) (((uint32_t)(((uint32_t)(x)) << FTM_CONF_LDFQ_SHIFT)) & FTM_CONF_LDFQ_MASK)

#define FTM_CONF_BDMMODE_MASK (0xC0U)
#define FTM_CONF_BDMMODE_SHIFT (6U)
#define FTM_CONF_BDMMODE_WIDTH (2U)
#define FTM_CONF_BDMMODE(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << FTM_CONF_BDMMODE_SHIFT)) & FTM_CONF_BDMMODE_MASK)

#define FTM_CONF_GTBEEN_MASK (0x200U)
#define FTM_CONF_GTBEEN_SHIFT (9U)
#define FTM_CONF_GTBEEN_WIDTH (1U)
#define FTM_CONF_GTBEEN(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << FTM_CONF_GTBEEN_SHIFT)) & FTM_CONF_GTBEEN_MASK)

#define FTM_CONF_GTBEOUT_MASK (0x400U)
#define FTM_CONF_GTBEOUT_SHIFT (10U)
#define FTM_CONF_GTBEOUT_WIDTH (1U)
#define FTM_CONF_GTBEOUT(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << FTM_CONF_GTBEOUT_SHIFT)) & FTM_CONF_GTBEOUT_MASK)

#define FTM_CONF_ITRIGR_MASK (0x800U)
#define FTM_CONF_ITRIGR_SHIFT (11U)
#define FTM_CONF_ITRIGR_WIDTH (1U)
#define FTM_CONF_ITRIGR(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << FTM_CONF_ITRIGR_SHIFT)) & FTM_CONF_ITRIGR_MASK)
/*! @} */

/*! @name FLTPOL - FTM Fault Input Polarity */
/*! @{ */

#define FTM_FLTPOL_FLT0POL_MASK (0x1U)
#define FTM_FLTPOL_FLT0POL_SHIFT (0U)
#define FTM_FLTPOL_FLT0POL_WIDTH (1U)
#define FTM_FLTPOL_FLT0POL(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_FLTPOL_FLT0POL_SHIFT)) & FTM_FLTPOL_FLT0POL_MASK)

#define FTM_FLTPOL_FLT1POL_MASK (0x2U)
#define FTM_FLTPOL_FLT1POL_SHIFT (1U)
#define FTM_FLTPOL_FLT1POL_WIDTH (1U)
#define FTM_FLTPOL_FLT1POL(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_FLTPOL_FLT1POL_SHIFT)) & FTM_FLTPOL_FLT1POL_MASK)

#define FTM_FLTPOL_FLT2POL_MASK (0x4U)
#define FTM_FLTPOL_FLT2POL_SHIFT (2U)
#define FTM_FLTPOL_FLT2POL_WIDTH (1U)
#define FTM_FLTPOL_FLT2POL(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_FLTPOL_FLT2POL_SHIFT)) & FTM_FLTPOL_FLT2POL_MASK)

#define FTM_FLTPOL_FLT3POL_MASK (0x8U)
#define FTM_FLTPOL_FLT3POL_SHIFT (3U)
#define FTM_FLTPOL_FLT3POL_WIDTH (1U)
#define FTM_FLTPOL_FLT3POL(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_FLTPOL_FLT3POL_SHIFT)) & FTM_FLTPOL_FLT3POL_MASK)
/*! @} */

/*! @name SYNCONF - Synchronization Configuration */
/*! @{ */

#define FTM_SYNCONF_HWTRIGMODE_MASK (0x1U)
#define FTM_SYNCONF_HWTRIGMODE_SHIFT (0U)
#define FTM_SYNCONF_HWTRIGMODE_WIDTH (1U)
#define FTM_SYNCONF_HWTRIGMODE(x)                                                                  \
    (((uint32_t)(((uint32_t)(x)) << FTM_SYNCONF_HWTRIGMODE_SHIFT)) & FTM_SYNCONF_HWTRIGMODE_MASK)

#define FTM_SYNCONF_CNTINC_MASK (0x4U)
#define FTM_SYNCONF_CNTINC_SHIFT (2U)
#define FTM_SYNCONF_CNTINC_WIDTH (1U)
#define FTM_SYNCONF_CNTINC(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_SYNCONF_CNTINC_SHIFT)) & FTM_SYNCONF_CNTINC_MASK)

#define FTM_SYNCONF_INVC_MASK (0x10U)
#define FTM_SYNCONF_INVC_SHIFT (4U)
#define FTM_SYNCONF_INVC_WIDTH (1U)
#define FTM_SYNCONF_INVC(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << FTM_SYNCONF_INVC_SHIFT)) & FTM_SYNCONF_INVC_MASK)

#define FTM_SYNCONF_SWOC_MASK (0x20U)
#define FTM_SYNCONF_SWOC_SHIFT (5U)
#define FTM_SYNCONF_SWOC_WIDTH (1U)
#define FTM_SYNCONF_SWOC(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << FTM_SYNCONF_SWOC_SHIFT)) & FTM_SYNCONF_SWOC_MASK)

#define FTM_SYNCONF_SYNCMODE_MASK (0x80U)
#define FTM_SYNCONF_SYNCMODE_SHIFT (7U)
#define FTM_SYNCONF_SYNCMODE_WIDTH (1U)
#define FTM_SYNCONF_SYNCMODE(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FTM_SYNCONF_SYNCMODE_SHIFT)) & FTM_SYNCONF_SYNCMODE_MASK)

#define FTM_SYNCONF_SWRSTCNT_MASK (0x100U)
#define FTM_SYNCONF_SWRSTCNT_SHIFT (8U)
#define FTM_SYNCONF_SWRSTCNT_WIDTH (1U)
#define FTM_SYNCONF_SWRSTCNT(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FTM_SYNCONF_SWRSTCNT_SHIFT)) & FTM_SYNCONF_SWRSTCNT_MASK)

#define FTM_SYNCONF_SWWRBUF_MASK (0x200U)
#define FTM_SYNCONF_SWWRBUF_SHIFT (9U)
#define FTM_SYNCONF_SWWRBUF_WIDTH (1U)
#define FTM_SYNCONF_SWWRBUF(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FTM_SYNCONF_SWWRBUF_SHIFT)) & FTM_SYNCONF_SWWRBUF_MASK)

#define FTM_SYNCONF_SWOM_MASK (0x400U)
#define FTM_SYNCONF_SWOM_SHIFT (10U)
#define FTM_SYNCONF_SWOM_WIDTH (1U)
#define FTM_SYNCONF_SWOM(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << FTM_SYNCONF_SWOM_SHIFT)) & FTM_SYNCONF_SWOM_MASK)

#define FTM_SYNCONF_SWINVC_MASK (0x800U)
#define FTM_SYNCONF_SWINVC_SHIFT (11U)
#define FTM_SYNCONF_SWINVC_WIDTH (1U)
#define FTM_SYNCONF_SWINVC(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_SYNCONF_SWINVC_SHIFT)) & FTM_SYNCONF_SWINVC_MASK)

#define FTM_SYNCONF_SWSOC_MASK (0x1000U)
#define FTM_SYNCONF_SWSOC_SHIFT (12U)
#define FTM_SYNCONF_SWSOC_WIDTH (1U)
#define FTM_SYNCONF_SWSOC(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_SYNCONF_SWSOC_SHIFT)) & FTM_SYNCONF_SWSOC_MASK)

