rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_FTM.h
#define FTM_SYNCONF_HWRSTCNT_MASK (0x10000U)
#define FTM_SYNCONF_HWRSTCNT_SHIFT (16U)
#define FTM_SYNCONF_HWRSTCNT_WIDTH (1U)
#define FTM_SYNCONF_HWRSTCNT(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FTM_SYNCONF_HWRSTCNT_SHIFT)) & FTM_SYNCONF_HWRSTCNT_MASK)

#define FTM_SYNCONF_HWWRBUF_MASK (0x20000U)
#define FTM_SYNCONF_HWWRBUF_SHIFT (17U)
#define FTM_SYNCONF_HWWRBUF_WIDTH (1U)
#define FTM_SYNCONF_HWWRBUF(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FTM_SYNCONF_HWWRBUF_SHIFT)) & FTM_SYNCONF_HWWRBUF_MASK)

#define FTM_SYNCONF_HWOM_MASK (0x40000U)
#define FTM_SYNCONF_HWOM_SHIFT (18U)
#define FTM_SYNCONF_HWOM_WIDTH (1U)
#define FTM_SYNCONF_HWOM(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << FTM_SYNCONF_HWOM_SHIFT)) & FTM_SYNCONF_HWOM_MASK)

#define FTM_SYNCONF_HWINVC_MASK (0x80000U)
#define FTM_SYNCONF_HWINVC_SHIFT (19U)
#define FTM_SYNCONF_HWINVC_WIDTH (1U)
#define FTM_SYNCONF_HWINVC(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_SYNCONF_HWINVC_SHIFT)) & FTM_SYNCONF_HWINVC_MASK)

#define FTM_SYNCONF_HWSOC_MASK (0x100000U)
#define FTM_SYNCONF_HWSOC_SHIFT (20U)
#define FTM_SYNCONF_HWSOC_WIDTH (1U)
#define FTM_SYNCONF_HWSOC(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_SYNCONF_HWSOC_SHIFT)) & FTM_SYNCONF_HWSOC_MASK)
/*! @} */

/*! @name INVCTRL - FTM Inverting Control */
/*! @{ */

#define FTM_INVCTRL_INV0EN_MASK (0x1U)
#define FTM_INVCTRL_INV0EN_SHIFT (0U)
#define FTM_INVCTRL_INV0EN_WIDTH (1U)
#define FTM_INVCTRL_INV0EN(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_INVCTRL_INV0EN_SHIFT)) & FTM_INVCTRL_INV0EN_MASK)

#define FTM_INVCTRL_INV1EN_MASK (0x2U)
#define FTM_INVCTRL_INV1EN_SHIFT (1U)
#define FTM_INVCTRL_INV1EN_WIDTH (1U)
#define FTM_INVCTRL_INV1EN(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_INVCTRL_INV1EN_SHIFT)) & FTM_INVCTRL_INV1EN_MASK)

#define FTM_INVCTRL_INV2EN_MASK (0x4U)
#define FTM_INVCTRL_INV2EN_SHIFT (2U)
#define FTM_INVCTRL_INV2EN_WIDTH (1U)
#define FTM_INVCTRL_INV2EN(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_INVCTRL_INV2EN_SHIFT)) & FTM_INVCTRL_INV2EN_MASK)

#define FTM_INVCTRL_INV3EN_MASK (0x8U)
#define FTM_INVCTRL_INV3EN_SHIFT (3U)
#define FTM_INVCTRL_INV3EN_WIDTH (1U)
#define FTM_INVCTRL_INV3EN(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_INVCTRL_INV3EN_SHIFT)) & FTM_INVCTRL_INV3EN_MASK)
/*! @} */

/*! @name SWOCTRL - FTM Software Output Control */
/*! @{ */

#define FTM_SWOCTRL_CH0OC_MASK (0x1U)
#define FTM_SWOCTRL_CH0OC_SHIFT (0U)
#define FTM_SWOCTRL_CH0OC_WIDTH (1U)
#define FTM_SWOCTRL_CH0OC(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_SWOCTRL_CH0OC_SHIFT)) & FTM_SWOCTRL_CH0OC_MASK)

#define FTM_SWOCTRL_CH1OC_MASK (0x2U)
#define FTM_SWOCTRL_CH1OC_SHIFT (1U)
#define FTM_SWOCTRL_CH1OC_WIDTH (1U)
#define FTM_SWOCTRL_CH1OC(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_SWOCTRL_CH1OC_SHIFT)) & FTM_SWOCTRL_CH1OC_MASK)

#define FTM_SWOCTRL_CH2OC_MASK (0x4U)
#define FTM_SWOCTRL_CH2OC_SHIFT (2U)
#define FTM_SWOCTRL_CH2OC_WIDTH (1U)
#define FTM_SWOCTRL_CH2OC(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_SWOCTRL_CH2OC_SHIFT)) & FTM_SWOCTRL_CH2OC_MASK)

#define FTM_SWOCTRL_CH3OC_MASK (0x8U)
#define FTM_SWOCTRL_CH3OC_SHIFT (3U)
#define FTM_SWOCTRL_CH3OC_WIDTH (1U)
#define FTM_SWOCTRL_CH3OC(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_SWOCTRL_CH3OC_SHIFT)) & FTM_SWOCTRL_CH3OC_MASK)

#define FTM_SWOCTRL_CH4OC_MASK (0x10U)
#define FTM_SWOCTRL_CH4OC_SHIFT (4U)
#define FTM_SWOCTRL_CH4OC_WIDTH (1U)
#define FTM_SWOCTRL_CH4OC(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_SWOCTRL_CH4OC_SHIFT)) & FTM_SWOCTRL_CH4OC_MASK)

#define FTM_SWOCTRL_CH5OC_MASK (0x20U)
#define FTM_SWOCTRL_CH5OC_SHIFT (5U)
#define FTM_SWOCTRL_CH5OC_WIDTH (1U)
#define FTM_SWOCTRL_CH5OC(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_SWOCTRL_CH5OC_SHIFT)) & FTM_SWOCTRL_CH5OC_MASK)

#define FTM_SWOCTRL_CH6OC_MASK (0x40U)
#define FTM_SWOCTRL_CH6OC_SHIFT (6U)
#define FTM_SWOCTRL_CH6OC_WIDTH (1U)
#define FTM_SWOCTRL_CH6OC(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_SWOCTRL_CH6OC_SHIFT)) & FTM_SWOCTRL_CH6OC_MASK)

#define FTM_SWOCTRL_CH7OC_MASK (0x80U)
#define FTM_SWOCTRL_CH7OC_SHIFT (7U)
#define FTM_SWOCTRL_CH7OC_WIDTH (1U)
#define FTM_SWOCTRL_CH7OC(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_SWOCTRL_CH7OC_SHIFT)) & FTM_SWOCTRL_CH7OC_MASK)

#define FTM_SWOCTRL_CH0OCV_MASK (0x100U)
#define FTM_SWOCTRL_CH0OCV_SHIFT (8U)
#define FTM_SWOCTRL_CH0OCV_WIDTH (1U)
#define FTM_SWOCTRL_CH0OCV(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_SWOCTRL_CH0OCV_SHIFT)) & FTM_SWOCTRL_CH0OCV_MASK)

#define FTM_SWOCTRL_CH1OCV_MASK (0x200U)
#define FTM_SWOCTRL_CH1OCV_SHIFT (9U)
#define FTM_SWOCTRL_CH1OCV_WIDTH (1U)
#define FTM_SWOCTRL_CH1OCV(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_SWOCTRL_CH1OCV_SHIFT)) & FTM_SWOCTRL_CH1OCV_MASK)

#define FTM_SWOCTRL_CH2OCV_MASK (0x400U)
#define FTM_SWOCTRL_CH2OCV_SHIFT (10U)
#define FTM_SWOCTRL_CH2OCV_WIDTH (1U)
#define FTM_SWOCTRL_CH2OCV(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_SWOCTRL_CH2OCV_SHIFT)) & FTM_SWOCTRL_CH2OCV_MASK)

#define FTM_SWOCTRL_CH3OCV_MASK (0x800U)
#define FTM_SWOCTRL_CH3OCV_SHIFT (11U)
#define FTM_SWOCTRL_CH3OCV_WIDTH (1U)
#define FTM_SWOCTRL_CH3OCV(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_SWOCTRL_CH3OCV_SHIFT)) & FTM_SWOCTRL_CH3OCV_MASK)

#define FTM_SWOCTRL_CH4OCV_MASK (0x1000U)
#define FTM_SWOCTRL_CH4OCV_SHIFT (12U)
#define FTM_SWOCTRL_CH4OCV_WIDTH (1U)
#define FTM_SWOCTRL_CH4OCV(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_SWOCTRL_CH4OCV_SHIFT)) & FTM_SWOCTRL_CH4OCV_MASK)

#define FTM_SWOCTRL_CH5OCV_MASK (0x2000U)
#define FTM_SWOCTRL_CH5OCV_SHIFT (13U)
#define FTM_SWOCTRL_CH5OCV_WIDTH (1U)
#define FTM_SWOCTRL_CH5OCV(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_SWOCTRL_CH5OCV_SHIFT)) & FTM_SWOCTRL_CH5OCV_MASK)

#define FTM_SWOCTRL_CH6OCV_MASK (0x4000U)
#define FTM_SWOCTRL_CH6OCV_SHIFT (14U)
#define FTM_SWOCTRL_CH6OCV_WIDTH (1U)
#define FTM_SWOCTRL_CH6OCV(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_SWOCTRL_CH6OCV_SHIFT)) & FTM_SWOCTRL_CH6OCV_MASK)

