rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_FTM.h
#define FTM_SWOCTRL_CH7OCV_MASK (0x8000U)
#define FTM_SWOCTRL_CH7OCV_SHIFT (15U)
#define FTM_SWOCTRL_CH7OCV_WIDTH (1U)
#define FTM_SWOCTRL_CH7OCV(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_SWOCTRL_CH7OCV_SHIFT)) & FTM_SWOCTRL_CH7OCV_MASK)
/*! @} */

/*! @name PWMLOAD - FTM PWM Load */
/*! @{ */

#define FTM_PWMLOAD_CH0SEL_MASK (0x1U)
#define FTM_PWMLOAD_CH0SEL_SHIFT (0U)
#define FTM_PWMLOAD_CH0SEL_WIDTH (1U)
#define FTM_PWMLOAD_CH0SEL(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_PWMLOAD_CH0SEL_SHIFT)) & FTM_PWMLOAD_CH0SEL_MASK)

#define FTM_PWMLOAD_CH1SEL_MASK (0x2U)
#define FTM_PWMLOAD_CH1SEL_SHIFT (1U)
#define FTM_PWMLOAD_CH1SEL_WIDTH (1U)
#define FTM_PWMLOAD_CH1SEL(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_PWMLOAD_CH1SEL_SHIFT)) & FTM_PWMLOAD_CH1SEL_MASK)

#define FTM_PWMLOAD_CH2SEL_MASK (0x4U)
#define FTM_PWMLOAD_CH2SEL_SHIFT (2U)
#define FTM_PWMLOAD_CH2SEL_WIDTH (1U)
#define FTM_PWMLOAD_CH2SEL(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_PWMLOAD_CH2SEL_SHIFT)) & FTM_PWMLOAD_CH2SEL_MASK)

#define FTM_PWMLOAD_CH3SEL_MASK (0x8U)
#define FTM_PWMLOAD_CH3SEL_SHIFT (3U)
#define FTM_PWMLOAD_CH3SEL_WIDTH (1U)
#define FTM_PWMLOAD_CH3SEL(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_PWMLOAD_CH3SEL_SHIFT)) & FTM_PWMLOAD_CH3SEL_MASK)

#define FTM_PWMLOAD_CH4SEL_MASK (0x10U)
#define FTM_PWMLOAD_CH4SEL_SHIFT (4U)
#define FTM_PWMLOAD_CH4SEL_WIDTH (1U)
#define FTM_PWMLOAD_CH4SEL(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_PWMLOAD_CH4SEL_SHIFT)) & FTM_PWMLOAD_CH4SEL_MASK)

#define FTM_PWMLOAD_CH5SEL_MASK (0x20U)
#define FTM_PWMLOAD_CH5SEL_SHIFT (5U)
#define FTM_PWMLOAD_CH5SEL_WIDTH (1U)
#define FTM_PWMLOAD_CH5SEL(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_PWMLOAD_CH5SEL_SHIFT)) & FTM_PWMLOAD_CH5SEL_MASK)

#define FTM_PWMLOAD_CH6SEL_MASK (0x40U)
#define FTM_PWMLOAD_CH6SEL_SHIFT (6U)
#define FTM_PWMLOAD_CH6SEL_WIDTH (1U)
#define FTM_PWMLOAD_CH6SEL(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_PWMLOAD_CH6SEL_SHIFT)) & FTM_PWMLOAD_CH6SEL_MASK)

#define FTM_PWMLOAD_CH7SEL_MASK (0x80U)
#define FTM_PWMLOAD_CH7SEL_SHIFT (7U)
#define FTM_PWMLOAD_CH7SEL_WIDTH (1U)
#define FTM_PWMLOAD_CH7SEL(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_PWMLOAD_CH7SEL_SHIFT)) & FTM_PWMLOAD_CH7SEL_MASK)

#define FTM_PWMLOAD_HCSEL_MASK (0x100U)
#define FTM_PWMLOAD_HCSEL_SHIFT (8U)
#define FTM_PWMLOAD_HCSEL_WIDTH (1U)
#define FTM_PWMLOAD_HCSEL(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_PWMLOAD_HCSEL_SHIFT)) & FTM_PWMLOAD_HCSEL_MASK)

#define FTM_PWMLOAD_LDOK_MASK (0x200U)
#define FTM_PWMLOAD_LDOK_SHIFT (9U)
#define FTM_PWMLOAD_LDOK_WIDTH (1U)
#define FTM_PWMLOAD_LDOK(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << FTM_PWMLOAD_LDOK_SHIFT)) & FTM_PWMLOAD_LDOK_MASK)

#define FTM_PWMLOAD_GLEN_MASK (0x400U)
#define FTM_PWMLOAD_GLEN_SHIFT (10U)
#define FTM_PWMLOAD_GLEN_WIDTH (1U)
#define FTM_PWMLOAD_GLEN(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << FTM_PWMLOAD_GLEN_SHIFT)) & FTM_PWMLOAD_GLEN_MASK)

#define FTM_PWMLOAD_GLDOK_MASK (0x800U)
#define FTM_PWMLOAD_GLDOK_SHIFT (11U)
#define FTM_PWMLOAD_GLDOK_WIDTH (1U)
#define FTM_PWMLOAD_GLDOK(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_PWMLOAD_GLDOK_SHIFT)) & FTM_PWMLOAD_GLDOK_MASK)
/*! @} */

/*! @name HCR - Half Cycle Register */
/*! @{ */

#define FTM_HCR_HCVAL_MASK (0xFFFFU)
#define FTM_HCR_HCVAL_SHIFT (0U)
#define FTM_HCR_HCVAL_WIDTH (16U)
#define FTM_HCR_HCVAL(x) (((uint32_t)(((uint32_t)(x)) << FTM_HCR_HCVAL_SHIFT)) & FTM_HCR_HCVAL_MASK)
/*! @} */

/*! @name PAIR0DEADTIME - Pair 0 Deadtime Configuration */
/*! @{ */

#define FTM_PAIR0DEADTIME_DTVAL_MASK (0x3FU)
#define FTM_PAIR0DEADTIME_DTVAL_SHIFT (0U)
#define FTM_PAIR0DEADTIME_DTVAL_WIDTH (6U)
#define FTM_PAIR0DEADTIME_DTVAL(x)                                                                 \
    (((uint32_t)(((uint32_t)(x)) << FTM_PAIR0DEADTIME_DTVAL_SHIFT)) & FTM_PAIR0DEADTIME_DTVAL_MASK)

#define FTM_PAIR0DEADTIME_DTPS_MASK (0xC0U)
#define FTM_PAIR0DEADTIME_DTPS_SHIFT (6U)
#define FTM_PAIR0DEADTIME_DTPS_WIDTH (2U)
#define FTM_PAIR0DEADTIME_DTPS(x)                                                                  \
    (((uint32_t)(((uint32_t)(x)) << FTM_PAIR0DEADTIME_DTPS_SHIFT)) & FTM_PAIR0DEADTIME_DTPS_MASK)

#define FTM_PAIR0DEADTIME_DTVALEX_MASK (0xF0000U)
#define FTM_PAIR0DEADTIME_DTVALEX_SHIFT (16U)
#define FTM_PAIR0DEADTIME_DTVALEX_WIDTH (4U)
#define FTM_PAIR0DEADTIME_DTVALEX(x)                                                               \
    (((uint32_t)(((uint32_t)(x)) << FTM_PAIR0DEADTIME_DTVALEX_SHIFT)) &                            \
     FTM_PAIR0DEADTIME_DTVALEX_MASK)
/*! @} */

/*! @name PAIR1DEADTIME - Pair 1 Deadtime Configuration */
/*! @{ */

#define FTM_PAIR1DEADTIME_DTVAL_MASK (0x3FU)
#define FTM_PAIR1DEADTIME_DTVAL_SHIFT (0U)
#define FTM_PAIR1DEADTIME_DTVAL_WIDTH (6U)
#define FTM_PAIR1DEADTIME_DTVAL(x)                                                                 \
    (((uint32_t)(((uint32_t)(x)) << FTM_PAIR1DEADTIME_DTVAL_SHIFT)) & FTM_PAIR1DEADTIME_DTVAL_MASK)

#define FTM_PAIR1DEADTIME_DTPS_MASK (0xC0U)
#define FTM_PAIR1DEADTIME_DTPS_SHIFT (6U)
#define FTM_PAIR1DEADTIME_DTPS_WIDTH (2U)
#define FTM_PAIR1DEADTIME_DTPS(x)                                                                  \
    (((uint32_t)(((uint32_t)(x)) << FTM_PAIR1DEADTIME_DTPS_SHIFT)) & FTM_PAIR1DEADTIME_DTPS_MASK)

