rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_FTM.h
#define FTM_PAIR1DEADTIME_DTVALEX_MASK (0xF0000U)
#define FTM_PAIR1DEADTIME_DTVALEX_SHIFT (16U)
#define FTM_PAIR1DEADTIME_DTVALEX_WIDTH (4U)
#define FTM_PAIR1DEADTIME_DTVALEX(x)                                                               \
    (((uint32_t)(((uint32_t)(x)) << FTM_PAIR1DEADTIME_DTVALEX_SHIFT)) &                            \
     FTM_PAIR1DEADTIME_DTVALEX_MASK)
/*! @} */

/*! @name PAIR2DEADTIME - Pair 2 Deadtime Configuration */
/*! @{ */

#define FTM_PAIR2DEADTIME_DTVAL_MASK (0x3FU)
#define FTM_PAIR2DEADTIME_DTVAL_SHIFT (0U)
#define FTM_PAIR2DEADTIME_DTVAL_WIDTH (6U)
#define FTM_PAIR2DEADTIME_DTVAL(x)                                                                 \
    (((uint32_t)(((uint32_t)(x)) << FTM_PAIR2DEADTIME_DTVAL_SHIFT)) & FTM_PAIR2DEADTIME_DTVAL_MASK)

#define FTM_PAIR2DEADTIME_DTPS_MASK (0xC0U)
#define FTM_PAIR2DEADTIME_DTPS_SHIFT (6U)
#define FTM_PAIR2DEADTIME_DTPS_WIDTH (2U)
#define FTM_PAIR2DEADTIME_DTPS(x)                                                                  \
    (((uint32_t)(((uint32_t)(x)) << FTM_PAIR2DEADTIME_DTPS_SHIFT)) & FTM_PAIR2DEADTIME_DTPS_MASK)

#define FTM_PAIR2DEADTIME_DTVALEX_MASK (0xF0000U)
#define FTM_PAIR2DEADTIME_DTVALEX_SHIFT (16U)
#define FTM_PAIR2DEADTIME_DTVALEX_WIDTH (4U)
#define FTM_PAIR2DEADTIME_DTVALEX(x)                                                               \
    (((uint32_t)(((uint32_t)(x)) << FTM_PAIR2DEADTIME_DTVALEX_SHIFT)) &                            \
     FTM_PAIR2DEADTIME_DTVALEX_MASK)
/*! @} */

/*! @name PAIR3DEADTIME - Pair 3 Deadtime Configuration */
/*! @{ */

#define FTM_PAIR3DEADTIME_DTVAL_MASK (0x3FU)
#define FTM_PAIR3DEADTIME_DTVAL_SHIFT (0U)
#define FTM_PAIR3DEADTIME_DTVAL_WIDTH (6U)
#define FTM_PAIR3DEADTIME_DTVAL(x)                                                                 \
    (((uint32_t)(((uint32_t)(x)) << FTM_PAIR3DEADTIME_DTVAL_SHIFT)) & FTM_PAIR3DEADTIME_DTVAL_MASK)

#define FTM_PAIR3DEADTIME_DTPS_MASK (0xC0U)
#define FTM_PAIR3DEADTIME_DTPS_SHIFT (6U)
#define FTM_PAIR3DEADTIME_DTPS_WIDTH (2U)
#define FTM_PAIR3DEADTIME_DTPS(x)                                                                  \
    (((uint32_t)(((uint32_t)(x)) << FTM_PAIR3DEADTIME_DTPS_SHIFT)) & FTM_PAIR3DEADTIME_DTPS_MASK)

#define FTM_PAIR3DEADTIME_DTVALEX_MASK (0xF0000U)
#define FTM_PAIR3DEADTIME_DTVALEX_SHIFT (16U)
#define FTM_PAIR3DEADTIME_DTVALEX_WIDTH (4U)
#define FTM_PAIR3DEADTIME_DTVALEX(x)                                                               \
    (((uint32_t)(((uint32_t)(x)) << FTM_PAIR3DEADTIME_DTVALEX_SHIFT)) &                            \
     FTM_PAIR3DEADTIME_DTVALEX_MASK)
/*! @} */

/*! @name MOD_MIRROR - Mirror of Modulo Value */
/*! @{ */

#define FTM_MOD_MIRROR_FRACMOD_MASK (0xF800U)
#define FTM_MOD_MIRROR_FRACMOD_SHIFT (11U)
#define FTM_MOD_MIRROR_FRACMOD_WIDTH (5U)
#define FTM_MOD_MIRROR_FRACMOD(x)                                                                  \
    (((uint32_t)(((uint32_t)(x)) << FTM_MOD_MIRROR_FRACMOD_SHIFT)) & FTM_MOD_MIRROR_FRACMOD_MASK)

#define FTM_MOD_MIRROR_MOD_MASK (0xFFFF0000U)
#define FTM_MOD_MIRROR_MOD_SHIFT (16U)
#define FTM_MOD_MIRROR_MOD_WIDTH (16U)
#define FTM_MOD_MIRROR_MOD(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FTM_MOD_MIRROR_MOD_SHIFT)) & FTM_MOD_MIRROR_MOD_MASK)
/*! @} */

/*! @name CV_MIRROR - Mirror of Channel (n) Match Value */
/*! @{ */

#define FTM_CV_MIRROR_FRACVAL_MASK (0xF800U)
#define FTM_CV_MIRROR_FRACVAL_SHIFT (11U)
#define FTM_CV_MIRROR_FRACVAL_WIDTH (5U)
#define FTM_CV_MIRROR_FRACVAL(x)                                                                   \
    (((uint32_t)(((uint32_t)(x)) << FTM_CV_MIRROR_FRACVAL_SHIFT)) & FTM_CV_MIRROR_FRACVAL_MASK)

#define FTM_CV_MIRROR_VAL_MASK (0xFFFF0000U)
#define FTM_CV_MIRROR_VAL_SHIFT (16U)
#define FTM_CV_MIRROR_VAL_WIDTH (16U)
#define FTM_CV_MIRROR_VAL(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FTM_CV_MIRROR_VAL_SHIFT)) & FTM_CV_MIRROR_VAL_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group FTM_Register_Masks */

/*!
 * @}
 */ /* end of group FTM_Peripheral_Access_Layer */

#endif /* #if !defined(S32M24x_FTM_H_) */
